namespace consoleProject
{
    /*
     * ФИО студента: Ахметова Дарья ПАавловна
     * номер варианта: 2
     * условие задачи (скопировать из листа задания):
     * 1. Реализуйте сортировку массивов, используя шаблонный метод для определения различных алгоритмов сортировки (например, пузырьковая, быстрая, сортировка слиянием).
     * 2. Создайте бота для мессенджера, который может находиться в состояниях (ожидание ввода, выполнение команды, отправка сообщения). Поведение бота должно изменяться в зависимости от состояния.
     * 3. Создайте приложение для управления задачами (to-do list), где пользователи могут добавлять, удалять и помечать задачи как выполненные с помощью команд, а также отменять и повторять эти действия.
     * 
     */
    internal class Program
    {
        static void Main(string[] args)
        {
            
        }
    }
}